[M_Orchid_PlotMission02 MissionDefinition]
MissionDescription="Shade has suggested that, if you are to find the Lost Treasure of the Sands, you will need to meet up with a pirate queen named Captain Scarlett. Scarlett lives out in [place]Wurmwater[-place], which -- full disclosure -- contains no water. You'll need a hovercraft to reach [place]Wurmwater[-place], but thankfully, Shade has agreed to let you borrow his."
TurnInDescription="With Shade's hovercraft repaired, you can finally head out to [place]Wurmwater[-place] and find Captain Scarlett."

[M_Orchid_PlotMission02:KillWorm MissionObjectiveDefinition]
ProgressMessage="Kill sand worm queen"

[M_Orchid_PlotMission02:RepairSkiffSet MissionObjectiveSetCollectionDefinition]
MissionSummaryOverride="Repair Shade's hovercraft."
MissionDescriptionOverride="Shade has suggested that, if you are to find the Lost Treasure of the Sands, you will need to meet up with a pirate queen named Captain Scarlett. Scarlett lives out in [place]Wurmwater[-place], which -- full disclosure -- contains no water. You'll need to repair Shade's hovercraft in order to reach [place]Wurmwater[-place]. Shade believes the other residents of [place]Oasis[-place] might have the parts you need -- just go talk to them, find the parts, and repair the hovercraft."

[M_Orchid_PlotMission02:ReturnToShadeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Shade has suggested that, if you are to find the Lost Treasure of the Sands, you will need to meet up with a pirate queen named Captain Scarlett. Scarlett lives out in [place]Wurmwater[-place], which -- full disclosure -- contains no water. You'll need to return to Shade before heading out to [place]Wurmwater[-place] to gather some important information."

[M_Orchid_PlotMission02:SpeakTownfolk MissionObjectiveDefinition]
ProgressMessage="Talk to Oasis townfolk"

[M_Orchid_PlotMission02:TrackWorm MissionObjectiveDefinition]
ProgressMessage="Locate sand worm queen"

[M_Orchid_PlotMission02:UseShadySkiff MissionObjectiveDefinition]
ProgressMessage="Get in old sandskiff"
